# ForwardIterator Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CombinableElementArray..::..ForwardIterator Method
CombinableElementArray Class See Also
---
Retrieve a forward moving iterator to the array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual CombinableElementArrayIterator ForwardIterator()
```

Visual Basic
---
```text
Public Overridable Function ForwardIterator As CombinableElementArrayIterator
```

Visual C++
---
```text
public:
virtual CombinableElementArrayIterator^ ForwardIterator()
```

# ### Return Value
Returns a forward moving iterator to the array.
# See Also
CombinableElementArray Class
Autodesk.Revit.DB Namespace